{
  "backend/analytics.mo": "Defines analytics types and a `calculateAnalytics` function that iterates unsold inventory items to compute total inventory value, piece count, and counts by transaction type (sale, purchase, returned).",
  "backend/main.mo": "Main actor for the jewellery stock manager backend, exposing shared functions to add items, batch-add items, and record transactions, while maintaining maps for items, transactions, and customers with full analytics aggregation.",
  "backend/migration.mo": "Data migration module that transforms old actor state (using `#returned` item type) to new state (using `#purchaseReturn` and `#salesReturn`), mapping all items, transactions, and customer records.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: fixing backend analytics to show real dashboard values, splitting the Returns card into Purchase/Sales Returns cards, and applying the correct stock formula across Dashboard and StockView pages.",
  "frontend-file-summaries.txt": "Auto-generated summary file describing the purpose and key changes of each frontend source file in the project.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Jewellery Stock Manager' and mounting the React root via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Dashboard, Sales, Purchases, Returns, StockView, Customers, and Factory pages, all wrapped in a shared Layout.",
  "frontend/src/components/BarcodeScanner.tsx": "A camera-based barcode/QR scanner component that uses the `useQRScanner` hook to capture scans, parses results via `parseScannerString`, and calls `onItemScanned` with valid parsed items.",
  "frontend/src/components/CodeChartTabs.tsx": "Displays jewellery items grouped by 2-character code prefixes in a grid; allows drilling into a prefix to select items and accumulates selections with weight/piece totals before confirming.",
  "frontend/src/components/ExcelUploader.tsx": "A drag-and-drop/file-input component that loads the XLSX library lazily, parses uploaded Excel or CSV files row-by-row using `parseScannerString`, and returns valid `ParsedItem` results via `onItemsParsed`.",
  "frontend/src/components/FilteredStockView.tsx": "Shows a filtered list of jewellery items for a given code prefix using `StockTable` with row selection, and provides a button to add selected items to a parent selection via `onAddToSelection`.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a sticky header with the JewelTrack brand, a responsive navigation bar (desktop and mobile) linking to all main routes, a main content area, and a footer.",
  "frontend/src/components/ManualEntryForm.tsx": "A form for manually entering a jewellery item's code, gross/stone/net weights, and piece count with validation, calling `onItemAdded` with a `ParsedItem` on successful submission.",
  "frontend/src/components/ReportDownloader.tsx": "A dropdown button component that exports report data as either a CSV or tab-delimited text file, with optional column mapping support.",
  "frontend/src/components/StockSelector.tsx": "A stock item selection UI with search, prefix-based tabs, and a summary panel showing totals for selected items, triggering a callback on confirmation.",
  "frontend/src/components/StockTable.tsx": "A sortable, searchable table for displaying jewellery stock items with optional row selection via click and Ctrl+click.",
  "frontend/src/components/TransactionPreview.tsx": "A preview and editing interface for parsed transaction items that validates weight equations, supports inline edits/deletes, and submits confirmed items via batch mutation hooks.",
  "frontend/src/components/TransactionTotalsView.tsx": "Displays transactions grouped by date with date-range filtering, collapsible day rows, summary totals, and an optional CSV/text export button.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including analytics, stock, transactions, customers, and factory ledger. Mutations invalidate relevant query caches on success.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Sora fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark theme tokens including colors, borders, and sidebar variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the DOM root.",
  "frontend/src/pages/Customers.tsx": "Customers page that lists all customers in tabs, displays their sales and return transaction history filtered by an optional date range, and shows aggregate totals for weight and pieces.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that fetches analytics data and displays stat cards for current stock, sales, purchases, purchase returns, and sales returns with navigation links to detail pages.",
  "frontend/src/pages/Factory.tsx": "Displays a factory ledger page with summary cards (transaction count, gross weight, net weight, pieces) and a detailed table of factory transactions fetched via useFactoryLedger hook.",
  "frontend/src/pages/Purchases.tsx": "Purchases page that allows recording jewellery purchase transactions via Excel upload, manual entry, or barcode scan, and displays purchase history with totals.",
  "frontend/src/pages/Returns.tsx": "Returns page supporting both sales returns and purchase returns, with input via Excel, manual entry, or scanner, and a transaction preview/history view.",
  "frontend/src/pages/Sales.tsx": "Sales page for recording jewellery sales with optional customer name, supporting Excel upload, manual entry, barcode scan, and stock selection, plus sales history display.",
  "frontend/src/pages/StockView.tsx": "Displays live unsold inventory with summary cards for items, gross weight, net weight, and pieces computed from analytics data, plus a stock table and report downloader.",
  "frontend/src/utils/scannerParser.ts": "Parses raw barcode scanner strings into structured jewellery item data (code, gross weight, stone weight, net weight, pieces) using step-by-step extraction and integer-based decimal math for validation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom CSS-variable-based colors, fonts (Inter/Sora), border radii, box shadows, keyframe animations, and plugins (tailwindcss-animate, typography, container-queries).",
  "project_state.json": "Project state metadata for JewelTrack, an inventory management app, documenting version, architectural notes (stock formula), known issues (dashboard zeros, incorrect stock summary), existing features, and pending fix requests (AR-1 through AR-3)."
}