{
  "backend/analytics.mo": "Analytics module that calculates inventory metrics (total value, piece count, sales/purchase/return counts) from items and customers maps, filtering only unsold items.",
  "backend/main.mo": "Main backend actor managing jewellery inventory with CRUD operations for items, transactions, and customers, including batch operations and analytics integration with blob storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: dashboard stock calculation fix, stock view live data sync, badge label removal, and click-to-navigate functionality with associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages (Dashboard, Sales, Purchases, Returns, StockView, Customers, Factory), reusable components (ExcelUploader, TransactionPreview, StockTable), hooks, utilities, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for background, foreground, primary, secondary, accent, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, Sales, Purchases, Returns, StockView, Customers, and Factory pages wrapped in Layout component.",
  "frontend/src/components/BarcodeScanner.tsx": "QR/barcode scanner component using camera with video preview, scan overlay, error handling, camera switching, and mobile device detection for scanning jewellery codes.",
  "frontend/src/components/CodeChartTabs.tsx": "Component that groups available stock items by CODE prefix (first 2 characters) and displays them as clickable cards with counts and total gross weight. Allows accumulating selected items across multiple prefix groups before completing the transaction.",
  "frontend/src/components/ExcelUploader.tsx": "Component that handles Excel file uploads via drag-and-drop or file selection, dynamically loads the SheetJS (XLSX) library, extracts scanner strings from the first column, and parses them into structured item data.",
  "frontend/src/components/FilteredStockView.tsx": "Displays a filterable table of jewellery items for a specific CODE prefix with multi-select checkboxes, allowing users to select multiple items and add them to a transaction selection.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation bar for different sections (Dashboard, Sales, Purchases, Returns, Stock, Customers, Factory), and footer with branding and caffeine.ai attribution.",
  "frontend/src/components/ManualEntryForm.tsx": "Form component for manually entering jewellery item details (CODE, GW, SW, NW, PCS) with validation that checks the GW = SW + NW equation and marks items as VALID or MISTAKE accordingly.",
  "frontend/src/components/ReportDownloader.tsx": "Dropdown menu component that exports jewellery stock or transaction data to CSV (for Excel) or text format, with different column layouts for stock items versus transaction records.",
  "frontend/src/components/StockSelector.tsx": "Component for browsing and selecting stock items for transactions (sales, returns) with search, tabbed prefix grouping, and multi-select functionality that converts selected items to ParsedItem format.",
  "frontend/src/components/StockTable.tsx": "Reusable table component displaying jewellery items with search, sortable columns, row selection with checkboxes, and multi-select support via Ctrl/Cmd+click.",
  "frontend/src/components/TransactionPreview.tsx": "Preview and confirmation component for batch transactions that allows editing items, selecting valid entries, optionally capturing customer names, and submitting transactions to the backend actor.",
  "frontend/src/components/TransactionTotalsView.tsx": "Displays transaction history grouped by date with date range filtering, expandable groups, totals calculation, and report download functionality for specific transaction types.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching analytics, stock, transactions, customers, and factory ledger data from the backend actor, plus a mutation hook for batch transaction submission with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a modern coral and teal color theme for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/Customers.tsx": "Customer management page displaying a tabbed interface for viewing individual customer transaction histories (sales and returns) with date range filtering and summary statistics.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing current stock metrics (count, weights, pieces) in a collapsible card and transaction summaries for sales, purchases, and returns.",
  "frontend/src/pages/Factory.tsx": "Factory ledger page displaying purchase and return transactions in a table with summary cards showing total counts, weights, and pieces.",
  "frontend/src/pages/Purchases.tsx": "Purchase entry page with tabbed interface offering three input methods (Excel upload, manual entry, barcode scanning) and a view for transaction totals.",
  "frontend/src/pages/Returns.tsx": "Returns page with tabs for Sales Return and Purchase Return, each supporting Excel upload, manual entry, and barcode scanning for item entry, plus a view totals tab. Uses parseScannerString to validate barcode data and displays transaction previews.",
  "frontend/src/pages/Sales.tsx": "Sales page with tabs for making entries (via Excel upload, manual entry, or barcode scanning) and viewing totals. Includes CodeChartTabs for stock selection and uses parseScannerString for barcode validation.",
  "frontend/src/pages/StockView.tsx": "Stock inventory page displaying live stock (unsold items) with summary cards for item count, total gross weight, and total pieces. Includes a filterable stock table and report download functionality.",
  "frontend/src/utils/scannerParser.ts": "Parser utility that extracts CODE, PCS, and weight values (GW, SW, NW) from jewellery scanner strings. Uses exact decimal arithmetic to validate weight equations (GW = SW + NW or GW = NW) and returns VALID, MISTAKE, or INVALID status.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including color palette (primary, success, warning, etc.), custom fonts (Inter, Poppins, JetBrains Mono), shadow utilities, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata documenting the jewellery stock management system architecture, scanner string parsing rules, known issues (stock data sync, filtering, navigation, mobile UI), and existing features for dashboard, sales, purchases, and returns sections."
}