{
  "backend/main.mo": "Main Motoko actor implementing jewellery inventory management with items, transactions, customers, and analytics; includes blob storage mixin and migration support.",
  "backend/migration.mo": "Migration module that converts old actor state to new schema by adding isSold field to JewelleryItem and propagating changes through transactions and customers.",
  "feature_evidence.json": "Feature evidence report documenting UI cleanup, dashboard analytics fixes, CODE chart tabs redesign, and other implemented features with file mappings and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend TypeScript/React files covering pages, components, hooks, utilities, and configuration for the jewellery management application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for Dashboard, Sales, Purchases, Returns, Stock, Customers, and Factory pages wrapped in Layout component.",
  "frontend/src/components/CodeChartTabs.tsx": "Component displaying CODE prefix groups as colorful chart tabs for stock selection, with accumulated multi-selection support and filtered view navigation for sales/returns.",
  "frontend/src/components/ExcelUploader.tsx": "Component for uploading and parsing Excel files containing scanner strings, dynamically loads the XLSX library, extracts data from the first column, and passes parsed items to a callback.",
  "frontend/src/components/FilteredStockView.tsx": "Displays a filtered list of jewellery items by CODE prefix with checkbox selection, allows users to select items and returns them as ParsedItem objects when done.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header, navigation menu for different sections (Dashboard, Sales, Purchases, Returns, Stock, Customers, Factory), and footer with branding.",
  "frontend/src/components/ManualEntryForm.tsx": "Form component for manually entering jewellery item details (CODE, GW, SW, NW, PCS), validates that GW equals SW + NW within tolerance, and adds items to preview.",
  "frontend/src/components/StockSelector.tsx": "Component for browsing and selecting items from current stock inventory with search functionality, grouped by CODE prefix tabs, and checkbox selection for transactions or returns.",
  "frontend/src/components/StockTable.tsx": "Displays jewellery stock items in a sortable, searchable table with columns for code, weights, pieces, and item type badges (Sale, Purchase, Return).",
  "frontend/src/components/TransactionPreview.tsx": "Displays a preview table of scanned items with validation status, allows editing/deleting items, and submits batch transactions to the backend with optional customer creation for sales.",
  "frontend/src/components/TransactionTotalsView.tsx": "Shows transaction totals (count, gross weight, net weight, pieces) for today and overall, grouped by item category prefix, for a specific transaction type.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state and identity persistence using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching analytics, stock, transactions, customers, and factory ledger data from the backend actor, plus a mutation hook for batch transactions.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using an elegant jewellery-themed color palette with warm golds and refined neutrals.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/Customers.tsx": "Displays a list of customers with their transaction counts and allows selecting a customer to view detailed ledger and holdings information in tabs. Uses useCustomers hook to fetch data and renders customer details including transaction history and current holdings.",
  "frontend/src/pages/Dashboard.tsx": "Shows an overview dashboard with current stock metrics (items, gross/stone/net weight, pieces) and transaction summary counts for sales, purchases, and returns. Calculates totals from stock items and transaction data using multiple query hooks.",
  "frontend/src/pages/Factory.tsx": "Displays factory ledger transactions with summary cards showing total transactions, gross weight, net weight, and pieces. Renders a table of all factory transactions with date, type, code, and weight details.",
  "frontend/src/pages/Purchases.tsx": "Manages purchase entries with tabs for making entries (via Excel upload or manual form) and viewing totals. Maintains parsed items state and passes them to TransactionPreview component for purchase transaction type.",
  "frontend/src/pages/Returns.tsx": "Handles both purchase returns and sales returns in separate card sections, each with tabs for making entries and viewing totals. Supports Excel upload, manual entry, and stock selection for sales returns.",
  "frontend/src/pages/Sales.tsx": "Manages sales entries with tabs for making entries and viewing totals, featuring CodeChartTabs for stock selection, Excel upload, and manual entry form. Passes parsed items to TransactionPreview for sale transaction type.",
  "frontend/src/pages/StockView.tsx": "Displays all stock items in a table using the useStock hook and StockTable component. Shows item count in the card header with loading skeletons during data fetch.",
  "frontend/src/utils/scannerParser.ts": "Parses jewellery scanner strings to extract CODE, PCS, and weight values (GW, SW, NW) using exact decimal arithmetic. Validates parsed data by checking if GW = SW + NW (3-part) or GW = NW with SW = 0 (2-part), returning status VALID, MISTAKE, or INVALID.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Playfair Display, JetBrains Mono), accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining a jewellery stock management system with Dashboard, Sales, Purchases, and Returns sections. Documents scanner parser logic, Excel upload requirements, real-time stock sync, customer/factory ledger tracking, and exact decimal validation rules."
}