{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify UI, fix Dashboard totals, redesign Sales/Returns with CODE chart tabs and live stock filtering",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Remove excessive celebration text and explanatory content from all pages to create a cleaner, professional UI",
      "acceptanceCriteria": [
        "All page headers use concise titles without lengthy explanations",
        "No redundant descriptive text about what each section does",
        "UI focuses on data and actions rather than instructional content"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Remove verbose welcome text and explanatory descriptions from the Dashboard header, keeping only essential title and metrics"
        },
        {
          "path": "frontend/src/pages/Sales.tsx",
          "operation": "modify",
          "description": "Simplify Sales page header by removing use case explanations and keeping only the title and action tabs"
        },
        {
          "path": "frontend/src/pages/Purchases.tsx",
          "operation": "modify",
          "description": "Remove explanatory text from Purchases page header, retaining only the page title and functional tabs"
        },
        {
          "path": "frontend/src/pages/Returns.tsx",
          "operation": "modify",
          "description": "Simplify Returns page by removing verbose descriptions for Purchase Return and Sales Return sections, keeping only clear section titles"
        },
        {
          "path": "frontend/src/pages/StockView.tsx",
          "operation": "modify",
          "description": "Remove any instructional or explanatory content from Stock View page, keeping only the title and table"
        },
        {
          "path": "frontend/src/pages/Customers.tsx",
          "operation": "modify",
          "description": "Simplify Customers page header by removing explanatory content and keeping only essential page title and customer list"
        },
        {
          "path": "frontend/src/pages/Factory.tsx",
          "operation": "modify",
          "description": "Remove verbose descriptions from Factory page header, keeping only the concise title and transaction display"
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Fix Dashboard analytics to correctly aggregate values from all four transaction types",
      "acceptanceCriteria": [
        "Dashboard total stock equals current inventory after all transactions",
        "Transaction counts match the sum of Sales + Purchases + Sales Return + Purchase Return",
        "Weight totals (GW, NW, SW) aggregate correctly across all transaction types",
        "Dashboard values update in real-time when new transactions are recorded"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Refactor analytics calculation logic to fetch and aggregate transaction data from all four types (sale, purchase, returned for both sales and purchases). Calculate totals by summing transactions across all types, ensuring stock counts reflect current inventory state. Use useQueries hooks to fetch getTransactionsByType for each ItemType variant and compute derived totals correctly"
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or enhance query hooks to support fetching transactions for all ItemType variants (sale, purchase, returned) and ensure they can be composed for Dashboard aggregation calculations"
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Simplify main Dashboard layout by removing duplicate data displays",
      "acceptanceCriteria": [
        "No statistics are displayed in both summary cards and chart sections",
        "Layout presents overview metrics at the top with detailed breakdowns below",
        "User can understand the full picture without seeing the same numbers twice"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Restructure Dashboard layout to show high-level summary cards at the top (total inventory value, piece count, transaction counts) and detailed breakdown charts or tabs below without repeating the same statistics. Remove any duplicate displays of weights, counts, or values that appear in both sections"
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Redesign Sales and Sales Return pages to display CODE groups as colorful chart tabs",
      "acceptanceCriteria": [
        "CODE prefix groups (e.g., NKST, CTNKST) render as visual chart-style tabs with distinct colors",
        "Each chart tab is clickable and visually distinct",
        "Current stock selector component is replaced with this chart tab interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CodeChartTabs.tsx",
          "operation": "create",
          "description": "Create a new component that displays CODE prefix groups as colorful chart-style tabs. Extract unique CODE prefixes from stock items, assign distinct colors to each prefix, and render them as clickable visual tabs with a chart-like appearance. Each tab shows the CODE prefix label and uses Tailwind classes for color theming"
        },
        {
          "path": "frontend/src/pages/Sales.tsx",
          "operation": "modify",
          "description": "Replace the existing StockSelector component with the new CodeChartTabs component in the Make Entry tab. Wire CodeChartTabs to display CODE groups from available stock and handle tab clicks to navigate to filtered stock views"
        },
        {
          "path": "frontend/src/pages/Returns.tsx",
          "operation": "modify",
          "description": "Replace the StockSelector component in the Sales Return section with the CodeChartTabs component, enabling the same chart tab interface for selecting stock items to return"
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Implement drill-down functionality where clicking a CODE chart tab shows only matching stock rows with isolated row selection",
      "acceptanceCriteria": [
        "Clicking a CODE chart tab navigates to a filtered view showing only matching stock items",
        "Users can select multiple rows within the filtered view",
        "Selections are isolated per CODE tab and do not carry over when switching tabs",
        "A back or return action brings the user to the chart tab overview"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CodeChartTabs.tsx",
          "operation": "modify",
          "description": "Add click handler to each chart tab that triggers a callback passing the selected CODE prefix to the parent component for drill-down navigation"
        },
        {
          "path": "frontend/src/components/FilteredStockView.tsx",
          "operation": "create",
          "description": "Create a new component that displays a filtered table of stock items matching a specific CODE prefix. Include checkboxes for row selection, a back button to return to the chart tab overview, and local state to manage selected items within this CODE group only"
        },
        {
          "path": "frontend/src/pages/Sales.tsx",
          "operation": "modify",
          "description": "Add state to track the currently active CODE prefix and switch between CodeChartTabs overview and FilteredStockView drill-down. When a user clicks a chart tab, show the FilteredStockView with items filtered by that CODE prefix. On back action, return to the chart tab overview"
        },
        {
          "path": "frontend/src/pages/Returns.tsx",
          "operation": "modify",
          "description": "Add state and navigation logic to the Sales Return section to switch between CodeChartTabs and FilteredStockView when a CODE tab is clicked, ensuring isolated row selection per CODE group"
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Allow users to navigate between CODE tabs, accumulate selections, and finalize all as a single batch transaction",
      "acceptanceCriteria": [
        "User can visit multiple CODE tabs sequentially and select rows in each",
        "All selections across tabs are aggregated and preserved",
        "Chart tab overview displays a 'Record Entry' button when selections exist",
        "Clicking 'Record Entry' submits all selected items as a single transaction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FilteredStockView.tsx",
          "operation": "modify",
          "description": "Emit selected items to parent component when user completes selection and clicks a 'Done' or 'Add to Cart' button, allowing the parent to accumulate selections across multiple CODE tabs"
        },
        {
          "path": "frontend/src/pages/Sales.tsx",
          "operation": "modify",
          "description": "Add global state to accumulate selected items from multiple CODE tabs across drill-down sessions. Display a 'Record Entry' button on the CodeChartTabs overview screen when accumulated selections exist. Wire the button to pass all accumulated items to TransactionPreview for batch submission"
        },
        {
          "path": "frontend/src/pages/Returns.tsx",
          "operation": "modify",
          "description": "Add global state in the Sales Return section to accumulate selections from multiple CODE tabs. Show a 'Record Entry' button on the chart tab overview when selections exist, and wire it to TransactionPreview for batch submission of sales return items"
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Update stock filtering logic to display only current live stock reflecting the latest transaction state",
      "acceptanceCriteria": [
        "Stock selector in each transaction page queries current inventory state from backend",
        "Items sold to a customer are immediately removed from available stock",
        "Purchase entries add new items to available stock instantly",
        "Sales Return entries restore items to available stock",
        "Purchase Return entries remove items from available stock"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update or create a query hook that fetches current live stock by calling backend methods that return only available inventory (excluding items already sold or removed). Ensure this hook is used by all transaction pages to display live stock state"
        },
        {
          "path": "frontend/src/components/CodeChartTabs.tsx",
          "operation": "modify",
          "description": "Update to consume the live stock query hook, ensuring the CODE chart tabs only display CODE groups present in current available inventory"
        },
        {
          "path": "frontend/src/components/FilteredStockView.tsx",
          "operation": "modify",
          "description": "Use the live stock query to filter and display only currently available items matching the selected CODE prefix, excluding items already assigned to customers or removed from inventory"
        },
        {
          "path": "frontend/src/components/StockSelector.tsx",
          "operation": "modify",
          "description": "If this component is still used elsewhere (Purchases or other pages), update it to query live stock state instead of all items, ensuring it reflects current inventory after each transaction"
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Optimize transaction recording performance to ensure batch entries are processed quickly",
      "acceptanceCriteria": [
        "Batch submission of multiple rows completes in under 2 seconds",
        "No loading spinners for more than 2 seconds during submission",
        "Backend processes batch inserts efficiently",
        "UI remains responsive during transaction recording",
        "Success feedback appears immediately after submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionPreview.tsx",
          "operation": "modify",
          "description": "Optimize batch submission logic by using the backend's addBatchTransactions method for multi-row entries instead of multiple individual calls. Add optimistic UI updates, display a brief loading state, and show immediate success feedback once the backend responds. Ensure loading indicators resolve within 2 seconds or provide progress feedback"
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutation hook for batch transaction submission that leverages addBatchTransactions backend method. Configure mutation to invalidate relevant queries (analytics, stock, transactions) immediately after success to refresh the UI with updated data"
        }
      ]
    }
  ]
}